{"packages": [{"name": "mrtrix", "version": "3.0.4", "docker": "mrtrix3/mrtrix3:3.0.4", "docs": {"title": "MRTrix3", "description": "MRtrix3 provides a set of tools to perform various types of diffusion MRI analyses, from various forms of tractography through to next-generation group-level analyses. It is designed with consistency, performance, and stability in mind, and is freely available under an open-source license. It is developed and maintained by a team of experts in the field, fostering an active community of users from diverse backgrounds.", "authors": ["MRTrix3 Developers"], "literature": [], "urls": ["https://www.mrtrix.org/"]}}, {"name": "mrtrix3tissue", "version": "5.2.8", "docker": "brainlife/3tissue:5.2.8", "docs": {"title": "MRTrix3Tissue", "description": "MRtrix3Tissue is a fork of the MRtrix3 project. It aims to add capabilities for 3-Tissue CSD modelling and analysis to a complete version of the MRtrix3 software.", "authors": ["MRTrix3Tissue Developers"], "literature": [], "urls": ["https://3tissue.github.io/"]}}, {"name": "greedy", "version": "1.0.1", "docker": "pyushkevich/itksnap:v3.8.2", "docs": {"title": "Greedy", "description": "Greedy is a tool for fast medical image registration. It was developed by Paul Yushkevich at the Penn Image Computing and Science Lab at the University of Pennsylvania. The motivation for developing greedy was to have a really fast CPU-based deformable image registration tool that could be used in applications where many images have to be registered in parallel - like multi-atlas image segmentation.\n\nGreedy borrows many concepts (and some implementation strategies) from the Symmetric Normalization (SyN) in ANTS. But greedy is non-symmetric, which makes it faster (in applications like multi-atlas segmentation, symmetric property is not required). Greedy also uses highly optimized code for image metric computation that adds extra speed.", "authors": ["Greedy Developers"], "literature": [], "urls": ["https://sites.google.com/view/greedyreg/about"]}}, {"name": "c3d", "version": "1.1.0", "docker": "pyushkevich/itksnap:v3.8.2", "docs": {"title": "Convert3D", "description": "Convert3D (unix name c3d) is a command-line image processing tool that offers complementary features to ITK-SNAP. Originally developed to convert between various 3D image formats, the tool has become more of a Swiss army knife for medical image processing. In addition to many standard filters and resampling commands, c3d offers tools specialized for multilabel images (such as segmentation images output by ITK-SNAP) and multicomponent images (such as RGB images read by SNAP). Through the use of reverse polish notation on the command line, c3d allows many image processing tasks to be combined in small command-line mini-programs. This saves on the need to save intermediate image files, saving disk space and network bandwidth. We use c3d extensively to run studies with thousands of 3D images, and are continually adding commands and features to the tool.", "authors": ["Convert3D Developers"], "literature": [], "urls": ["http://www.itksnap.org/pmwiki/pmwiki.php?n=Convert3D.Convert3D"]}}, {"name": "niftyreg", "version": "1.4.0", "docker": "vnmd/niftyreg_1.4.0:20220819", "docs": {"title": "NiftyReg", "description": "NiftyReg is an open-source software for efficient medical image registration. It has been mainly developed by members of the Centre for Medical Image Computing at University College London, UK.", "authors": ["NiftyReg Developers"], "literature": [], "urls": ["http://cmictig.cs.ucl.ac.uk/wiki/index.php/NiftyReg"]}}, {"name": "afni", "version": "24.2.06", "docker": "afni/afni_make_build:AFNI_24.2.06", "docs": {"title": "AFNI", "description": "AFNI (Analysis of Functional NeuroImages) is a leading software suite of C, Python, R programs and shell scripts primarily developed for the analysis and display of multiple MRI modalities: anatomical, functional MRI (FMRI) and diffusion weighted (DW) data. It is freely available (both as open source code and as precompiled binaries) for research purposes. The software is made to run on virtually any Unix system with X11 and Motif displays. Binary packages are provided for MacOS and Linux systems such as Fedora, CentOS/Red Hat and Ubuntu (which includes the Windows Subsystem for Linux).", "authors": ["AFNI Developers"], "literature": [], "urls": ["https://afni.nimh.nih.gov/"]}}, {"name": "fastsurfer", "version": "2.3.3", "docker": "deepmi/fastsurfer:cpu-v2.3.3", "docs": {"title": "FastSurfer", "description": "FastSurfer is a fast and accurate deep-learning based neuroimaging pipeline. It provides a full FreeSurfer alternative for volumetric analysis (FastSurferVINN) and surface-based thickness analysis (recon-surf). The deep learning models were trained on 60+ manually annotated brain scans and provide state-of-the-art accuracy. FastSurfer can segment a full brain scan in less than 1 minute, is robust against changes in input scanner contrasts, and generalizes well to non-training data.\n\nFastSurfer includes three main components:\n1. FastSurferVINN - A deep learning architecture for whole brain segmentation\n2. CerebNet - For detailed cerebellum sub-segmentation\n3. HypVINN - For hypothalamus sub-segmentation\n\nThe pipeline produces FreeSurfer-compatible outputs and can be used as a drop-in replacement for FreeSurfer's recon-all pipeline, while being orders of magnitude faster.", "authors": ["Deep-MI Lab, Massachusetts General Hospital"], "literature": [], "urls": ["https://github.com/Deep-MI/FastSurfer"]}}, {"name": "dcm2niix", "version": "1.0.20240202", "docker": "vnmd/dcm2niix_v1.0.20240202:20241125", "docs": {"title": "dcm2niix", "description": "Chris Rorden's dcm2niiX - DICOM to NIfTI converter. Converts DICOM files to NIfTI format with optional BIDS sidecar generation.", "authors": ["Chris Rorden"], "literature": [], "urls": ["https://github.com/rordenlab/dcm2niix"]}}, {"name": "freesurfer", "version": "7.4.1", "docker": "freesurfer/freesurfer:7.4.1", "docs": {"title": "FreeSurfer", "description": "FreeSurfer is a software package for the analysis and visualization of neuroimaging data from cross-sectional and longitudinal studies. It is developed by the Laboratory for Computational Neuroimaging at the Martinos Center for Biomedical Imaging.\n\nFreeSurfer provides full processing streams for structural and functional MRI and includes tools for linear and nonlinear registration, cortical and subcortical segmentation, cortical surface reconstruction, statistical analysis of group morphometry, diffusion MRI, PET analysis, and much more. It is also the structural MRI analysis software of choice for the Human Connectome Project.", "authors": ["FreeSurfer Developers"], "literature": [], "urls": ["https://github.com/freesurfer/freesurfer"]}}, {"name": "fsl", "version": "6.0.4", "docker": "brainlife/fsl:6.0.4-patched2", "docs": {"title": "FSL", "description": "FSL is a comprehensive library of analysis tools for FMRI, MRI and diffusion brain imaging data. It runs on macOS (Intel and M1/M2/M3), Linux, and Windows via the Windows Subsystem for Linux, and is very easy to install. Most of the tools can be run both from the command line and as GUIs (\"point-and-click\" graphical user interfaces). To quote the relevant references for FSL tools you should look in the individual tools' manual pages, and also please reference one or more of the FSL overview papers:\n\nM.W. Woolrich, S. Jbabdi, B. Patenaude, M. Chappell, S. Makni, T. Behrens, C. Beckmann, M. Jenkinson, S.M. Smith. Bayesian analysis of neuroimaging data in FSL. NeuroImage, 45:S173-86, 2009\n\nS.M. Smith, M. Jenkinson, M.W. Woolrich, C.F. Beckmann, T.E.J. Behrens, H. Johansen-Berg, P.R. Bannister, M. De Luca, I. Drobnjak, D.E. Flitney, R. Niazy, J. Saunders, J. Vickers, Y. Zhang, N. De Stefano, J.M. Brady, and P.M. Matthews. Advances in functional and structural MR image analysis and implementation as FSL. NeuroImage, 23(S1):208-19, 2004\n\nM. Jenkinson, C.F. Beckmann, T.E. Behrens, M.W. Woolrich, S.M. Smith. FSL. NeuroImage, 62:782-90, 2012", "authors": ["FMRIB Analysis Group, University of Oxford"], "literature": [], "urls": ["https://fsl.fmrib.ox.ac.uk/fsl/fslwiki"]}}, {"name": "workbench", "version": "1.5.0", "docker": "brainlife/connectome_workbench:1.5.0-freesurfer-update", "docs": {"title": "Connectome Workbench", "description": "Connectome Workbench is an open source, freely available visualization and discovery tool used to map neuroimaging data, especially data generated by the Human Connectome Project. The distribution includes wb_view, a GUI-based visualiation platform, and wb_command, a command-line program for performing a variety of algorithmic tasks using volume, surface, and grayordinate data. wb_command is necessary for running HCP data processing pipelines.", "authors": ["Connectome Workbench Developers"], "literature": [], "urls": ["https://github.com/Washington-University/workbench"]}}, {"name": "ants", "version": "2.5.3", "docker": "antsx/ants:v2.5.3", "docs": {"title": "ANTs", "description": "Advanced Normalization Tools (ANTs) is a C++ library available through the command line that computes high-dimensional mappings to capture the statistics of brain structure and function. It allows one to organize, visualize and statistically explore large biomedical image sets. Additionally, it integrates imaging modalities in space + time and works across species or organ systems with minimal customization.\n\nThe ANTs library is considered a state-of-the-art medical image registration and segmentation toolkit which depends on the Insight ToolKit, a widely used medical image processing library to which ANTs developers contribute. ANTs-related tools have also won several international, unbiased competitions such as MICCAI, BRATS, and STACOM.", "authors": ["ANTs Developers"], "literature": [], "urls": ["https://github.com/ANTsX/ANTs"]}}]}